# ApplyTo Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionType..::..ApplyTo Property
StructuralConnectionType Class See Also
---
Choose whether this connection type applies to beams and braces, to tops of columns, or to bases of columns.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public StructuralConnectionApplyTo ApplyTo { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ApplyTo As StructuralConnectionApplyTo
	Get
```

Visual C++
---
```text
public:
property StructuralConnectionApplyTo ApplyTo {
	StructuralConnectionApplyTo get ();
}
```

# Remarks
The property cannot be changed. Create a new StructuralConnectionType if a different value is needed.
# See Also
StructuralConnectionType Class
Autodesk.Revit.DB.Structure Namespace